dev/app/rails/app/controllers/home_controller.rb

  def index
    @killmails = Killmail.includes(:killmail_items, :killmail_attackers).order(killmail_time: :desc)

    @kills_last_hour  = Killmail.where(killmail_time: 60.minutes.ago.utc..).kills.count
    @kills_last_day   = Killmail.where(killmail_time: 1.day.ago.utc..).kills.count
    @kills_last_week  = Killmail.where(killmail_time: 1.week.ago.utc..).kills.count
---
SELECT "killmails".* FROM "killmails" ORDER BY "killmails"."killmail_time" DESC
SELECT COUNT(*) FROM "killmails" WHERE "killmails"."killmail_time" >= $1  [["killmail_time", "2020-02-29 07:38:07.399149"]]
SELECT COUNT(*) FROM "killmails" WHERE "killmails"."killmail_time" >= $1  [["killmail_time", "2020-02-23 07:38:07.400422"]]
SELECT COUNT(*) FROM "killmails" WHERE "killmails"."killmail_time" >= $1  [["killmail_time", "2020-02-01 07:38:07.401726"]]