dev/app/rails/lib/esi-get-recent-corp-kills.rb

  def check_db(all_meta_killmails) # check pokill db for killmail already imported, return any that are not

    for_import = []
    all_meta_killmails.each do |meta_killmail|
       killmail_id = meta_killmail.killmail_id
       unless Killmail.find_by(killmail_id: killmail_id)
---
SELECT "killmails".* FROM "killmails" WHERE "killmails"."killmail_id" = $1 LIMIT $2  [["killmail_id", 81970191], ["LIMIT", 1]]